<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"c92a116bf867eb98de78bd59c618dbb2a67b68fede4d71658ff89a5c0a5c9829","plan_job_ref":"Job plan #4 at https://github.com/GSA/usnotify-ssb/actions/runs/4086562296","plan_hash":"e7c7fa5a72aeae23df82bcb8d4112d05d8e9c6310d8eade3fee1a8f3dd7f0d4d","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __production__
<details>
<summary>Plan: 14 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.smtp_broker_policies["AWSCertificateManagerFullAccess"] will be created
  + resource "aws_iam_user_policy_attachment" "smtp_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-us-gov:iam::aws:policy/AWSCertificateManagerFullAccess"
      + user       = "ssb-smtp-broker"
    }

  # aws_iam_user_policy_attachment.smtp_broker_policies["AmazonRoute53FullAccess"] will be created
  + resource "aws_iam_user_policy_attachment" "smtp_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-us-gov:iam::aws:policy/AmazonRoute53FullAccess"
      + user       = "ssb-smtp-broker"
    }

  # aws_iam_user_policy_attachment.smtp_broker_policies["smtp_broker"] will be created
  + resource "aws_iam_user_policy_attachment" "smtp_broker_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssb-smtp-broker"
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-smtp"
      + path                       = "./app-ssb-smtp.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "aJd/AbBGYTlIZOOZwPEATyFY6ra7e447sZTd5XhOOTg="
      + space                      = "a022fabe-056c-4329-9d4f-3f7a67442d36"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_smtp.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-smtp-notify-management"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "a022fabe-056c-4329-9d4f-3f7a67442d36"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-demo"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "a022fabe-056c-4329-9d4f-3f7a67442d36"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "4447d89a-9735-4d82-94e1-dc07713aa460"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-smtp-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
      + space                          = "a022fabe-056c-4329-9d4f-3f7a67442d36"
      + tags                           = [
          + "mysql",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.broker_smtp.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.broker_smtp.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.smtp_broker_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "SMTP broker policy (covers SES, IAM, and supplementary Route53)"
      + id          = (known after apply)
      + name        = "smtp_broker"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateUser",
                          + "iam:DeleteUser",
                          + "iam:GetUser",
                          + "iam:CreateAccessKey",
                          + "iam:DeleteAccessKey",
                          + "iam:GetUserPolicy",
                          + "iam:PutUserPolicy",
                          + "iam:DeleteUserPolicy",
                          + "iam:CreatePolicy",
                          + "iam:DeletePolicy",
                          + "iam:GetPolicy",
                          + "iam:AttachUserPolicy",
                          + "iam:DetachUserPolicy",
                          + "iam:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sns:CreateTopic",
                          + "sns:DeleteTopic",
                          + "sns:SetTopicAttributes",
                          + "sns:GetTopicAttributes",
                          + "sns:ListTagsForResource",
                          + "sns:Subscribe",
                          + "sns:Unsubscribe",
                          + "sns:GetSubscriptionAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssb-smtp-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-smtp-broker"
    }

  # module.ssb-smtp-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-smtp-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_spaces = [
      + "gsa-tts-benefits-studio-prototyping/notify-demo",
      + "gsa-tts-benefits-studio-prototyping/notify-management",
      + "gsa-tts-benefits-studio-prototyping/notify-prod",
    ]
```
</details>

:white_check_mark: Plan applied in [apply #3](https://github.com/GSA/usnotify-ssb/actions/runs/4086577272)